# To Merge  or Join DataFrames

In [5]:
import pandas as pd

df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [6]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

# 1 _ Ordinary Merge pased on Coulmn defualt

In [8]:
O_M = pd.merge( df1 , df2 , on = "city")
O_M

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [12]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [13]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

# 2 _ Inner Join  defult of how

In [14]:
I_J_M = pd.merge( df1 , df2 , on = "city" , how = "inner")
I_J_M

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

# 3 _ Outer join

In [15]:
O_J_M = pd.merge( df1 , df2 , on = "city" , how = "outer")
O_J_M

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

# 4 _ Left Join

In [16]:
L_J_M = pd.merge( df1 ,df2 , on = "city" , how = "left")
L_J_M

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

# 5 _ Right Join

In [17]:
R_J_M = pd.merge( df1 ,df2 , on = "city" , how = "right")
R_J_M

        city  temperature  humidity
0   new york         21.0        68
1    chicago         14.0        65
2  san diego          NaN        71

# To Known relational between data

In [21]:
R_J = pd.merge( df1 , df2 , on = "city" , how = "left" , indicator = True)
R_J

        city  temperature  humidity     _merge
0   new york           21      68.0       both
1    chicago           14      65.0       both
2    orlando           35       NaN  left_only
3  baltimore           38       NaN  left_only

In [22]:
R_J = pd.merge( df1 , df2 , on = "city" , how = "right" , indicator = True)
R_J

        city  temperature  humidity      _merge
0   new york         21.0        68        both
1    chicago         14.0        65        both
2  san diego          NaN        71  right_only

In [23]:
R_J = pd.merge( df1 , df2 , on = "city" , how = "outer" , indicator = True)
R_J

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only